Autodesk.Revit.DB.Element.GetChangeTypeElementType
Returns ChangeType associated with a change in the type of an element.
Remarks:
remarks: Use this change type to trigger an Updater when the value of an element's type.
Note: This change type will not trigger on newly created or deleted elements or on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on any change in an element.

Autodesk.Revit.DB.Element.VersionId
Get the element version Id.
Remarks:
The VersionId is really the EpisodeId. This has the useful property that it is stable upon
document upgrade, unlike VersionGUID. This is internal API as it exposes the bare integer value.
It is not appropriate to make it public API without changing it to return a hash instead.
Any changes to this property will have impact for the ATF Revit Producer's change keys.

Autodesk.Revit.DB.Element.VersionGuid
Get the element version Guid.
Remarks:
If element version Guid is the same for a certain element in two instances of the saved file
then we guarantee that the two elements are identical. One element version covers a period of time
that is larger than a single transaction: it is a period between two saves, synchronize to central and reload latest.
Thus, in an opened document in-between saves or synchronize actions,
this version cannot be used to determine if any particular element has changed. To watch for element changes happening in-session,
use event Autodesk::Revit::ApplicationServices::Application::DocumentChanged.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When the Element is transient or when the Document has no version Guid for this Element.
Since:
2021